pmo-dataset/graphviz/06.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "ParallelGateway_1" -> "Generate shipping\nlabel";
  "ExclusiveGateway_1" -> "Customer places\norder online";
  "Customer places\norder online" -> "ExclusiveGateway_2";
  "start" -> "ExclusiveGateway_1";
  "Successful delivery" -> "ExclusiveGateway_3";
  "Send tracking\ninformation to\ncustomer" -> "ExclusiveGateway_4";
  "ExclusiveGateway_2" -> "Generate and send\norder confirmation";
  "Customer places\norder over the phone" -> "ExclusiveGateway_2";
  "Generate and send\norder confirmation" -> "ParallelGateway_1";
  "Process customer\nfeedback or returns" -> "ExclusiveGateway_5";
  "ParallelGateway_1" -> "Pick and pack items";
  "Monitor shipment" -> "ExclusiveGateway_6";
  "Generate shipping\nlabel" -> "ParallelGateway_2";
  "Pick and pack items" -> "ParallelGateway_2";
  "ExclusiveGateway_1" -> "Customer places\norder over the phone";
  "ExclusiveGateway_3" -> "Process customer\nfeedback or returns";
  "ExclusiveGateway_6" -> "Successful delivery";
  "ExclusiveGateway_6" -> "ExclusiveGateway_4";
  "ExclusiveGateway_5" -> "end";
  "ExclusiveGateway_3" -> "ExclusiveGateway_5";
  "ParallelGateway_2" -> "Hand over order to\nlogistics provider";
  "ExclusiveGateway_4" -> "Monitor shipment";
  "Hand over order to\nlogistics provider" -> "Send tracking\ninformation to\ncustomer";

  "start" [shape=circle];
  "end" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ExclusiveGateway_5" [label="X", shape=diamond];
  "ExclusiveGateway_6" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
