pmo-dataset/variations/mermaid_with_ids/06.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Successful delivery"]
	Task_2["Customer places\norder online"]
	Task_3["Hand over order to\nlogistics provider"]
	Task_4["Customer places\norder over the phone"]
	Task_5["Monitor shipment"]
	Task_6["Pick and pack items"]
	Task_7["Generate and send\norder confirmation"]
	Task_8["Process customer\nfeedback or returns"]
	Task_9["Generate shipping\nlabel"]
	Task_10["Send tracking\ninformation to\ncustomer"]
	StartNoneEvent_1(("start"))
	EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"X"}
	ExclusiveGateway_4{"X"}
	ExclusiveGateway_5{"X"}
	ExclusiveGateway_6{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}

	ParallelGateway_1 --> Task_9
	ExclusiveGateway_1 --> Task_2
	Task_2 --> ExclusiveGateway_2
	StartNoneEvent_1 --> ExclusiveGateway_1
	Task_1 --> ExclusiveGateway_3
	Task_10 --> ExclusiveGateway_4
	ExclusiveGateway_2 --> Task_7
	Task_4 --> ExclusiveGateway_2
	Task_7 --> ParallelGateway_1
	Task_8 --> ExclusiveGateway_5
	ParallelGateway_1 --> Task_6
	Task_5 --> ExclusiveGateway_6
	Task_9 --> ParallelGateway_2
	Task_6 --> ParallelGateway_2
	ExclusiveGateway_1 --> Task_4
	ExclusiveGateway_3 --> Task_8
	ExclusiveGateway_6 --> Task_1
	ExclusiveGateway_6 --> ExclusiveGateway_4
	ExclusiveGateway_5 --> EndNoneEvent_1
	ExclusiveGateway_3 --> ExclusiveGateway_5
	ParallelGateway_2 --> Task_3
	ExclusiveGateway_4 --> Task_5
	Task_3 --> Task_10
